#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/th3pl4gu3-prod/github-api-workspace/runs/run-RxtZpBPkPPRN55Pb

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
module.email-function.data.external.archive_prepare[0]: Reading...
module.email-function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.email-function.data.aws_partition.current: Reading...
module.email-function.data.aws_partition.current: Read complete after 0s [id=aws]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_budgets_budget.monthly_limit_budget will be created
  + resource "aws_budgets_budget" "monthly_limit_budget" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + cost_filters      = (known after apply)
      + id                = (known after apply)
      + limit_amount      = "5"
      + limit_unit        = "USD"
      + name              = "monthly-limit-budget"
      + name_prefix       = (known after apply)
      + time_period_end   = "2080-01-01_00:00"
      + time_period_start = "2022-01-01_00:00"
      + time_unit         = "MONTHLY"

      + cost_filter {
          + name   = (known after apply)
          + values = (known after apply)
        }

      + cost_types {
          + include_credit             = (known after apply)
          + include_discount           = (known after apply)
          + include_other_subscription = (known after apply)
          + include_recurring          = (known after apply)
          + include_refund             = (known after apply)
          + include_subscription       = (known after apply)
          + include_support            = (known after apply)
          + include_tax                = (known after apply)
          + include_upfront            = (known after apply)
          + use_amortized              = (known after apply)
          + use_blended                = (known after apply)
        }

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "mervinhemaraju16@gmail.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 50
          + threshold_type             = "PERCENTAGE"
        }
      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "FORECASTED"
          + subscriber_email_addresses = [
              + "mervinhemaraju16@gmail.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 90
          + threshold_type             = "PERCENTAGE"
        }
    }

  # module.email-function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/email-function"
      + retention_in_days = 7
      + tags_all          = {
          + "Creator"     = "mervin.hemaraju"
          + "Environment" = "Production"
          + "Project"     = "th3pl4gu3-aws"
          + "Usage"       = "Personal"
        }
    }

  # module.email-function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "The lambda for sending emails from contact forms"
      + filename                       = "builds/f5df9b0328a7549f93cbf45498414ad47952e9aa7b1baca906256c7cfe516f6a.zip"
      + function_name                  = "email-function"
      + handler                        = "main.main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 2
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Creator"     = "mervin.hemaraju"
          + "Environment" = "Production"
          + "Project"     = "th3pl4gu3-aws"
          + "Usage"       = "Personal"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.email-function.aws_lambda_function_event_invoke_config.this["current_version"] will be created
  + resource "aws_lambda_function_event_invoke_config" "this" {
      + function_name          = "email-function"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
      + qualifier              = (known after apply)
    }

  # module.email-function.aws_lambda_function_event_invoke_config.this["unqualified_alias"] will be created
  + resource "aws_lambda_function_event_invoke_config" "this" {
      + function_name          = "email-function"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.email-function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.9",
                      + "./functions/email-function/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./functions/email-function/",
                      + null,
                    ],
                ]
              + filename      = "builds/f5df9b0328a7549f93cbf45498414ad47952e9aa7b1baca906256c7cfe516f6a.zip"
              + runtime       = "python3.9"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f5df9b0328a7549f93cbf45498414ad47952e9aa7b1baca906256c7cfe516f6a.plan.json"
      + id                   = (known after apply)
    }

  # module.email-function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f5df9b0328a7549f93cbf45498414ad47952e9aa7b1baca906256c7cfe516f6a.zip"
          + "timestamp" = "1666462651943373000"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @mervinhemaraju, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*